# üë®üèΩ‚Äçüíª Ejercicio Pandas: DataFrames 06

> Con un nuevo dataframe, realizar lo siguiente:

In [9]:
import pandas as pd
import numpy as np
# Dataset con los precios de las acciones de Microsoft desde el 2000 hasta el 2023:
df = pd.read_csv('c:\\Users\\Admin\\Documents\\ITS\\Semestre 9\\Data_Science\\Pandas\\Datasets\\msft_2000_2023.csv')

In [10]:
df.head()

       Date      Open     High       Low     Close  Adj Close    Volume
0  1/3/2000  58.68750  59.3125  56.00000  58.28125  36.132248  53228400
1  1/4/2000  56.78125  58.5625  56.12500  56.31250  34.911709  54119000
2  1/5/2000  55.56250  58.1875  54.68750  56.90625  35.279816  64059600
3  1/6/2000  56.09375  56.9375  54.18750  55.00000  34.098019  54976600
4  1/7/2000  54.31250  56.1250  53.65625  55.71875  34.543629  62013600

#### 1Ô∏è‚É£ Realizar una funci√≥n que involucre 2 columnas:

In [11]:
def calc_difference(open, close):
    """
    Calcula la diferencia entre el precio de apertura y el precio de cierre.
    """
    return open - close

In [12]:
# Uso de la funci√≥n calc_difference:
calc_difference(10, 3)

7

#### 2Ô∏è‚É£ Utilizar `np.vectorize` y aplicar el resultado a una nueva columna.

In [13]:
# Guardar la diferencia en una nueva columna:
df["Difference"] = np.vectorize(calc_difference)(df["Open"], df["Close"])
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Difference
0,1/3/2000,58.68750,59.3125,56.00000,58.28125,36.132248,53228400,0.40625
1,1/4/2000,56.78125,58.5625,56.12500,56.31250,34.911709,54119000,0.46875
2,1/5/2000,55.56250,58.1875,54.68750,56.90625,35.279816,64059600,-1.34375
3,1/6/2000,56.09375,56.9375,54.18750,55.00000,34.098019,54976600,1.09375
4,1/7/2000,54.31250,56.1250,53.65625,55.71875,34.543629,62013600,-1.40625

#### 3Ô∏è‚É£ Ordenar los valores en una columna que usted indique.

In [14]:
# Ordenar de forma descendente por la columna ¬´Volume¬ª:
df.sort_values("Volume", ascending=False)

,Date,Open,High,Low,Close,Adj Close,Volume,Difference
1588,4/28/2006,24.230000,24.500000,24.000000,24.150000,17.148354,591052200,0.080000
2848,4/29/2011,26.549999,26.639999,25.360001,25.920000,20.187849,319317900,0.629999
77,4/24/2000,33.625000,34.000000,32.500000,33.312500,20.652540,313645800,0.312500
2031,2/1/2008,31.059999,33.250000,30.250000,30.450001,22.157578,291138900,0.609998
1965,10/26/2007,36.009998,36.029999,34.560001,35.029999,25.406311,288121200,0.979999
...,...,...,...,...,...,...,...,...
5762,11/25/2022,247.309998,248.699997,246.729996,247.490005,245.314819,9200800,-0.180007
4001,11/27/2015,53.799999,54.080002,53.790001,53.930000,47.925758,9009100,-0.130001
5026,12/24/2019,157.479996,157.710007,157.119995,157.380005,151.657349,8989200,0.099991
4252,11/25/2016,60.299999,60.529999,60.130001,60.529999,55.266979,8409600,-0.230000
4503,11/24/2017,83.010002,83.430000,82.779999,83.260002,77.718071,7425600,-0.250000

#### 4Ô∏è‚É£ Obtener el valor m√≠nimo, m√°ximo, su localizaci√≥n y ver la informaci√≥n de esa columna.

In [18]:
# M√≠nimo valor de la columna ¬´Volume¬ª:
df["Volume"].min()

7425600

In [19]:
# Localizaci√≥n del valor m√≠nimo de la columna ¬´Volume¬ª:
df["Volume"].idxmin()

4503

In [27]:
# Ver la informaci√≥n de registro anterior:
df.iloc[4503]

Date          11/24/2017
Open           83.010002
High               83.43
Low            82.779999
Close          83.260002
Adj Close      77.718071
Volume           7425600
Difference         -0.25
Name: 4503, dtype: object

In [22]:
# M√°ximo valor de la columna ¬´Volume¬ª:
df["Volume"].max()

591052200

In [23]:
# Localizaci√≥n del valor m√°ximo de la columna ¬´Volume¬ª:
df["Volume"].idxmax()

1588

In [26]:
# Ver la informaci√≥n de registro anterior:
df.iloc[1588]

Date          4/28/2006
Open              24.23
High               24.5
Low                24.0
Close             24.15
Adj Close     17.148354
Volume        591052200
Difference         0.08
Name: 1588, dtype: object

In [20]:
# Ver la informaci√≥n de la columna ¬´Volume¬ª:
df["Volume"].describe()

count    6.012000e+03
mean     5.132949e+07
std      3.074841e+07
min      7.425600e+06
25%      2.865732e+07
50%      4.605860e+07
75%      6.504930e+07
max      5.910522e+08
Name: Volume, dtype: float64

#### 5Ô∏è‚É£ Obtener, de 2 columnas, sus respectivos:

###### Creaci√≥n de nuevas columnas para poder realizar el ejercicio:

In [32]:
# Formatear la columna ¬´Date¬ª:
df["Date"] = pd.to_datetime(df["Date"])

# Validar el tipo de dato de la columna ¬´Date¬ª:
df["Date"].dtype

dtype('<M8[ns]')

In [34]:
# Crear una nueva columna con el a√±o de la columna ¬´Date¬ª:
df["Year"] = df["Date"].dt.year

# Crear una nueva columna con el mes de la columna ¬´Date¬ª:
df["Month"] = df["Date"].dt.month

In [35]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Difference,Year,Month
0,2000-01-03,58.68750,59.3125,56.00000,58.28125,36.132248,53228400,0.40625,2000,1
1,2000-01-04,56.78125,58.5625,56.12500,56.31250,34.911709,54119000,0.46875,2000,1
2,2000-01-05,55.56250,58.1875,54.68750,56.90625,35.279816,64059600,-1.34375,2000,1
3,2000-01-06,56.09375,56.9375,54.18750,55.00000,34.098019,54976600,1.09375,2000,1
4,2000-01-07,54.31250,56.1250,53.65625,55.71875,34.543629,62013600,-1.40625,2000,1

##### üßÆ `value_counts()`

In [36]:
# Contar el n√∫mero de registros por a√±o:
df["Year"].value_counts()

Year
2020    253
2008    253
2021    252
2019    252
2016    252
2015    252
2014    252
2013    252
2011    252
2000    252
2009    252
2005    252
2004    252
2003    252
2002    252
2010    252
2007    251
2022    251
2006    251
2017    251
2018    251
2012    250
2001    248
2023    225
Name: count, dtype: int64

In [37]:
# Contar el n√∫mero de registros por mes:
df["Month"].value_counts()

Month
8     534
10    529
3     527
6     512
5     509
7     505
4     494
11    487
1     486
9     485
12    484
2     460
Name: count, dtype: int64

##### üíé `unique()`

In [38]:
# Ver los valores √∫nicos de la columna ¬´Year¬ª:
df["Year"].unique()

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021,
       2022, 2023])

In [39]:
# Ver los valores √∫nicos de la columna ¬´Month¬ª:
df["Month"].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

#### 6Ô∏è‚É£ Hacer un reemplazo de nombres en una columna utilizando el m√©todo `map()`.

In [40]:
# Mapear los valores de la columna ¬´Month¬ª:
meses = {
    1: "Enero",
    2: "Febrero",
    3: "Marzo",
    4: "Abril",
    5: "Mayo",
    6: "Junio",
    7: "Julio",
    8: "Agosto",
    9: "Septiembre",
    10: "Octubre",
    11: "Noviembre",
    12: "Diciembre"
}

df["Month"] = df["Month"].map(meses)
df

,Date,Open,High,Low,Close,Adj Close,Volume,Difference,Year,Month
0,2000-01-03,58.687500,59.312500,56.000000,58.281250,36.132248,53228400,0.406250,2000,Enero
1,2000-01-04,56.781250,58.562500,56.125000,56.312500,34.911709,54119000,0.468750,2000,Enero
2,2000-01-05,55.562500,58.187500,54.687500,56.906250,35.279816,64059600,-1.343750,2000,Enero
3,2000-01-06,56.093750,56.937500,54.187500,55.000000,34.098019,54976600,1.093750,2000,Enero
4,2000-01-07,54.312500,56.125000,53.656250,55.718750,34.543629,62013600,-1.406250,2000,Enero
...,...,...,...,...,...,...,...,...,...,...
6007,2023-11-16,370.959991,376.350006,370.179993,376.170013,376.170013,27182300,-5.210022,2023,Noviembre
6008,2023-11-17,373.609985,374.369995,367.000000,369.850006,369.850006,40157000,3.759979,2023,Noviembre
6009,2023-11-20,371.220001,378.869995,371.000000,377.440002,377.440002,52465100,-6.220001,2023,Noviembre
6010,2023-11-21,375.670013,376.220001,371.119995,373.070007,373.070007,28423100,2.600006,2023,Noviembre
6011,2023-11-22,378.000000,379.790009,374.970001,377.850006,377.850006,23345300,0.149994,2023,Noviembre